HELYXcore-4.4.0/examples/legacy/multiphase/potentialFreeSurfaceDyMFoam/oscillatingBox/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication -s 1 topoSet

runApplication subsetMesh -overwrite c0 -patch floatingObject

runApplication -s selectBottom \
    topoSet -dict system/topoSetDict-selectBottom

runApplication createPatch -overwrite

restore0Dir

runApplication $(getApplication)

#------------------------------------------------------------------------------
