HELYXcore-4.4.0/examples/legacy/multiphase/potentialFreeSurfaceDyMFoam/oscillatingBox/system/topoSetDict-selectBottom
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    floatingObjectBottom;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   floatingObject;
        }
    }

    {
        name    floatingObjectBottom;
        type    faceSet;
        action  subset;
        source  normalToFace;
        sourceInfo
        {
            normal (0 1 0);     // Vector
            cos     0.01;       // Tolerance (max cos of angle)
        }
    }
);

// ************************************************************************* //
